InformationRegisters/бит_ПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПраваДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Копирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереносВГруппу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтменаПроведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Печать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СубъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныПравДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбластьДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбластиДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ОбластиДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ОбластиДоступа</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_ОбъектыСистемы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкиПостроителя</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/бит_ПраваДоступа/Ext/Module.bsl
#Область ПодпискиНаСобытия

// Процедура обработчик подписки "бит_ПередЗаписьюСправочникаПраваДоступа" на событие  "ПередЗаписью". 
//
// Параметры:
// Источник - СправочникОбъект.
// Отказ - Булево.
//
Процедура бит_ПередЗаписьюСправочникаПраваДоступаПередЗаписью(Источник, Отказ) Экспорт
	Если НЕ Отказ Тогда
		
		// БИТ_ЖКХ 05.10.2015 16:42:22 Начало правки... 
		Если (Метаданные.Справочники.Найти("Пользователи") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи"))
			ИЛИ (Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.ИдентификаторыОбъектовМетаданных")) 
			ИЛИ (Метаданные.Справочники.Найти("ИдентификаторыОбъектовРасширений") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.ИдентификаторыОбъектовРасширений")) 
			ИЛИ (Метаданные.Справочники.Найти("ГруппыДоступа") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.ГруппыДоступа")) 			
			Тогда		
			Возврат;                                                                                                                                                                  		
		КонецЕсли; 				
		//Если (Метаданные.Справочники.Найти("Пользователи") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.Пользователи"))
		//	ИЛИ (Метаданные.Справочники.Найти("ИдентификаторыОбъектовМетаданных") <> Неопределено И ТипЗнч(Источник) = Тип("СправочникОбъект.ИдентификаторыОбъектовМетаданных")) Тогда		
		//	Возврат;                                                                                                                                                                  		
		//КонецЕсли; 				
		// БИТ_ЖКХ 05.10.2015 16:42:25 Конец правки.
		
		События = ПроверитьПраваДоступа(Источник, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);
		
	КонецЕсли; 
КонецПроцедуры

// Процедура обработчик подписки "бит_ПриКопированииСправочникаПраваДоступа" на событие  "ПриКопировании". 
//
// Параметры:
// Источник - СправочникОбъект.
// ОбъектКопирование - СправочникОбъект.
//
Процедура бит_ПриКопированииСправочникаПраваДоступаПриКопировании(Источник, ОбъектКопирования) Экспорт
	Отказ = Ложь;
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Редактирование",Ложь);
	ТекущиеСобытия.Вставить("Создание",Ложь);		
	ТекущиеСобытия.Вставить("Копирование",Ложь);	
	
	События = ПроверитьПраваДоступа(Источник,бит_ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"),,ТекущиеСобытия);
	
	ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);			
	Если Отказ Тогда
		Источник.ДополнительныеСвойства.Вставить("Отказ",Истина);
	КонецЕсли; 
КонецПроцедуры

// Процедура обработчик подписки "бит_ПередЗаписьюДокументаПраваДоступа" на событие  "ПередЗаписью". 
//
// Параметры:
// Источник - ДокументОбъект.
// Отказ - Булево.
// РежимЗаписи - РежимЗаписиДокумента.
// РежимПроведения - РежимПроведенияДокумента.
//
Процедура бит_ПередЗаписьюДокументаПраваДоступаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если НЕ Отказ Тогда
		
		События = ПроверитьПраваДоступа(Источник, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"),РежимЗаписи);
		
		ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);
	КонецЕсли; 
КонецПроцедуры

// Процедура обработчик подписки "бит_ПриКопированииСправочникаПраваДоступа" на событие  "ПриКопировании". 
//
// Параметры:
// Источник - ДокументОбъект.
// ОбъектКопирование - ДокументОбъект.
//
Процедура бит_ПриКопированииДокументаПраваДоступаПриКопировании(Источник, ОбъектКопирования) Экспорт
	Отказ = Ложь;
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Редактирование",Ложь);
	ТекущиеСобытия.Вставить("Создание",Ложь);		
	ТекущиеСобытия.Вставить("Копирование",Ложь);	
	События = ПроверитьПраваДоступа(Источник,бит_ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"),,ТекущиеСобытия);
	ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);			
	Если Отказ Тогда
		Источник.ДополнительныеСвойства.Вставить("Отказ",Истина);
	КонецЕсли; 
КонецПроцедуры


// Процедура обработчик подписки "бит_ПередЗаписьюРегистраСведенийПраваДоступа" на событие  "ПередЗаписью". 
//
// Параметры:
// Источник - РегистрСведенийНаборЗаписей.
// Отказ    - Булево.
// Замещение- Булево.
//
Процедура бит_ПередЗаписьюРегистраСведенийПраваДоступаПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	МетаданныеРегистра = Источник.Метаданные();
	
	Если МетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
		Возврат;
	КонецЕсли; 
	
	Если (Метаданные.РегистрыСведений.Найти("РезультатыОбменаДанными") <> Неопределено И ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.РезультатыОбменаДанными"))
		ИЛИ (Метаданные.РегистрыСведений.Найти("ПраваРолей") <> Неопределено И ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ПраваРолей")) Тогда		
		Возврат;  		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		События = ПроверитьПраваДоступа(Источник, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		ОповеститьОбОтсутствииДоступа(Источник,События,Отказ);
	КонецЕсли; 
	
КонецПроцедуры

// БИТ_ЖКХ 14.09.2011
//
Процедура ПередЗаписьюЭлементаСправочника(Источник, Отказ) Экспорт
	
	//бит_ЗакрытыйСлужебныйСервер.ПровреритьВозможностьДобавления(Источник.ЭтоНовый(), Отказ); // БИТ_ЖКХ 13.04.2017 17:35:41 
	
КонецПроцедуры

#КонецОбласти

#Область ОбщиеФункцииИПроцедурыДоступа

// Процедура проверяет наличие прав доступа у данного пользователя на определенные действия над данным объектом.
// Перечень событий может быть передан в процедуру в виде структуры, либо может определяться автоматически,. 
// В зависимости от вида и состояния объекта.
//
// Параметры:
// ТекущийОбъект - СправочникОбъект,ДокументОбъект.
// ТекущийПользователь - СправочникСсылка.Пользователи.
// РежимЗаписи - РежимЗаписиДокумента.
// ТекущиеСобытия - Структура - ключ: строка- имя события, значение: булево - доступность события.
// ДопПараметры - Структура - Задел на будущее.
//
Функция ПроверитьПраваДоступа(ТекущийОбъект
	,ТекущийПользователь
	,РежимЗаписи=Неопределено
	,ТекущиеСобытия=Неопределено
	,ДопПараметры=Неопределено) Экспорт
	
	// Не проверяем права, если не включен механизм.
	Если не Константы.бит_ИспользоватьРазделениеДоступаНаУровнеБазы.Получить() Тогда
		Возврат Новый Структура;	
	КонецЕсли; 	
	
	// Определим имя объекта и вид объекта.
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);	
	ИмяОбъектаПолное = ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта);
	
	ТекущийОбъектДоступа = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное",ИмяОбъектаПолное);
	// Если объект не нашли, то это скорее всего внешний отчет или внешняя обработка.
	Если НЕ ЗначениеЗаполнено(ТекущийОбъектДоступа) Тогда
		Возврат Новый Структура;	
	КонецЕсли; 
	// Не проверяем права, если у объекта поднят флаг "Отключено".
	Если ТекущийОбъектДоступа.Отключено Тогда
		Возврат Новый Структура;	
	КонецЕсли; 
	
	// Не проверяем права для определенного перечня имен.
	МассивИсключений = СформироватьМассивИменИсключений();
	Если МассивИсключений.Найти(ИмяОбъекта) <> Неопределено Тогда
		Возврат Новый Структура;	
	КонецЕсли;
	
	// В режиме загрузки не проверяем права.
	Если НЕ (ВидОбъекта = Перечисления.бит_ВидыОбъектов.Отчет 
		ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектов.Обработка) 
		И ТекущийОбъект.ОбменДанными.Загрузка Тогда
		Возврат Новый Структура;	
	КонецЕсли; 	
	
	// Определим текущее события.
	Если ТекущиеСобытия = Неопределено Тогда
		События = ОпределитьТекущиеСобытия(ТекущийОбъект,МетаданныеОбъекта,ВидОбъекта,РежимЗаписи);
	Иначе	
		События = ТекущиеСобытия;
	КонецЕсли; 
	
	// Получим права по текущему объекту и пользователю.
	СтруктураПрав = ПолучитьПраваДоступа(МетаданныеОбъекта,ТекущийПользователь,ТекущийОбъект);
	
	Для каждого КлючИЗначение Из События Цикл
		События[КлючИЗначение.Ключ] = СтруктураПрав[КлючИЗначение.Ключ];
	КонецЦикла; 
	События.Вставить("ОбластиДоступа",СтруктураПрав.ОбластиДоступа);
	
	Возврат События;
	
КонецФункции	

// Процедура определяет перечень событий в зависимости от вида объекта и состояния объекта
//
// Параметры:
//  ТекущийОбъект  – СправочникСсылка,ДокументСсылка.
//  МетаданныеОбъекта - ОбъектМетаданных.
//  ВидОбъекта - ПеречислениеСсылка.бит_ВидыОбъектов.
//  РежимЗаписи- РежимЗаписиДокумента.
//                 
Функция ОпределитьТекущиеСобытия(ТекущийОбъект,МетаданныеОбъекта,ВидОбъекта,РежимЗаписи) 
	
	События = Новый Структура;
	
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ Тогда
		// Общие события для справочника и документа.
		События.Вставить("Редактирование",Ложь);
		Если ТекущийОбъект.ЭтоНовый() Тогда
			События.Вставить("Создание",Ложь);
		КонецЕсли; 
		Если НЕ ТекущийОбъект.ЭтоНовый() И ТекущийОбъект.ПометкаУдаления <> ТекущийОбъект.Ссылка.ПометкаУдаления Тогда
			События.Вставить("ПометкаНаУдаление",Ложь);
		КонецЕсли;
		
		// Специфические события справочника.
		Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник И МетаданныеОбъекта.Иерархический Тогда
			Если ТекущийОбъект.Родитель <> ТекущийОбъект.Ссылка.Родитель Тогда
				События.Вставить("ПереносВГруппу",Ложь);
			КонецЕсли; 
		КонецЕсли; 
		
		// Специфические события документа.
		Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ Тогда
			Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				События.Вставить("Проведение",Ложь);
			КонецЕсли; 
			Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
				События.Вставить("ОтменаПроведения",Ложь);
			КонецЕсли; 
		КонецЕсли; 
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.Отчет Тогда
		События.Вставить("Редактирование",Ложь);
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.Обработка Тогда
		События.Вставить("Редактирование",Ложь);
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.РегистрСведений Тогда
		События.Вставить("Редактирование",Ложь);
	КонецЕсли; 
	
	Возврат События;
КонецФункции // бит_ОпределитьТекущиеСобытия()

// Функция получает все права пользователя на данный объект.
//
// Параметры:
// МетаданныеОбъекта  – ОбъектМетаданных.
// ТекущийПользователь - СправочникСсылка.Пользователи.
//                 
Функция ПолучитьПраваДоступа(МетаданныеОбъекта,ТекущийПользователь,ТекущийОбъект) Экспорт
	
	РезСтруктура = Новый Структура;
	РезСтруктура.Вставить("Редактирование"   ,Ложь);
	РезСтруктура.Вставить("Создание"         ,Ложь);
	РезСтруктура.Вставить("Копирование"      ,Ложь);
	РезСтруктура.Вставить("ПометкаНаУдаление",Ложь);
	РезСтруктура.Вставить("ПереносВГруппу"   ,Ложь);
	РезСтруктура.Вставить("Проведение"       ,Ложь);
	РезСтруктура.Вставить("ОтменаПроведения" ,Ложь);
	РезСтруктура.Вставить("Печать"           ,Ложь);
	РезСтруктура.Вставить("ОбластиДоступа"   ,Новый Массив);
	
	
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
	ИмяОбъектаПолное = ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта);
	
	// Получим области доступа для текущего объекта.
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ Тогда
		МассивОбластейДоступа = ПолучитьМассивОбластейДоступа(ТекущийОбъект,МетаданныеОбъекта,ИмяОбъектаПолное);
	Иначе	
		МассивОбластейДоступа = Новый Массив;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Если МассивОбластейДоступа.Количество()=0 Тогда   // обычный запрос без областей доступа
		Запрос.Текст =  "ВЫБРАТЬ
		|	бит_ПраваДоступа.СубъектДоступа,
		|	бит_ПраваДоступа.ОбъектДоступа КАК ОбъектДоступа,
		|	бит_ПраваДоступа.Редактирование,
		|	бит_ПраваДоступа.Создание,
		|	бит_ПраваДоступа.Копирование,
		|	бит_ПраваДоступа.ПометкаНаУдаление,
		|	бит_ПраваДоступа.ПереносВГруппу,
		|	бит_ПраваДоступа.Проведение,
		|	бит_ПраваДоступа.ОтменаПроведения,
		|	бит_ПраваДоступа.Печать
		|ИЗ
		|	РегистрСведений.бит_ПраваДоступа КАК бит_ПраваДоступа
		|ГДЕ
		|	бит_ПраваДоступа.СубъектДоступа = &СубъектДоступа
		|	И бит_ПраваДоступа.ОбъектДоступа В
		|			(ВЫБРАТЬ
		|				бит_ОбъектыСистемы.Ссылка
		|			ИЗ
		|				Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
		|			ГДЕ
		|				бит_ОбъектыСистемы.ИмяОбъектаПолное = &ИмяОбъектаПолное)
		|	И бит_ПраваДоступа.ВидОбъекта = &ВидОбъекта
		|	И бит_ПраваДоступа.ОбластьДоступа = ЗНАЧЕНИЕ(Справочник.бит_ОбластиДоступа.ПустаяСсылка)";
		
	Иначе	    // Запрос по областям доступа.
		Запрос.Текст =  "ВЫБРАТЬ
		|	бит_ПраваДоступа.СубъектДоступа,
		|	бит_ПраваДоступа.ОбъектДоступа КАК ОбъектДоступа,
		|	МАКСИМУМ(бит_ПраваДоступа.Редактирование) КАК Редактирование,
		|	МАКСИМУМ(бит_ПраваДоступа.Создание) КАК Создание,
		|	МАКСИМУМ(бит_ПраваДоступа.Копирование) КАК Копирование,
		|	МАКСИМУМ(бит_ПраваДоступа.ПометкаНаУдаление) КАК ПометкаНаУдаление,
		|	МАКСИМУМ(бит_ПраваДоступа.ПереносВГруппу) КАК ПереносВГруппу,
		|	МАКСИМУМ(бит_ПраваДоступа.Проведение) КАК Проведение,
		|	МАКСИМУМ(бит_ПраваДоступа.ОтменаПроведения) КАК ОтменаПроведения,
		|	МАКСИМУМ(бит_ПраваДоступа.Печать) КАК Печать
		|ИЗ
		|	РегистрСведений.бит_ПраваДоступа КАК бит_ПраваДоступа
		|ГДЕ
		|	бит_ПраваДоступа.СубъектДоступа = &СубъектДоступа
		|	И бит_ПраваДоступа.ОбъектДоступа В
		|			(ВЫБРАТЬ
		|				бит_ОбъектыСистемы.Ссылка
		|			ИЗ
		|				Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
		|			ГДЕ
		|				бит_ОбъектыСистемы.ИмяОбъектаПолное = &ИмяОбъектаПолное
		|				И (НЕ бит_ОбъектыСистемы.Отключено))
		|	И бит_ПраваДоступа.ВидОбъекта = &ВидОбъекта
		|	И бит_ПраваДоступа.ОбластьДоступа В(&МассивОбластейДоступа)
		|	И (НЕ бит_ПраваДоступа.ОбластьДоступа.Отключено)
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ПраваДоступа.СубъектДоступа,
		|	бит_ПраваДоступа.ОбъектДоступа";
		
		Запрос.УстановитьПараметр("МассивОбластейДоступа",МассивОбластейДоступа);
	КонецЕсли; 
	
	
	Запрос.УстановитьПараметр("СубъектДоступа",ТекущийПользователь);
	Запрос.УстановитьПараметр("ИмяОбъектаПолное",ИмяОбъектаПолное);
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Для каждого КлючИЗначение Из РезСтруктура Цикл
			Если КлючИЗначение.Ключ = "ОбластиДоступа" Тогда
				Продолжить;
			КонецЕсли; 
			
			РезСтруктура[КлючИЗначение.Ключ] = Выборка[КлючИЗначение.Ключ];
		КонецЦикла; 
		
	КонецЕсли; 
	РезСтруктура.ОбластиДоступа = МассивОбластейДоступа;
	
	Возврат РезСтруктура;		
КонецФункции //ПолучитьПраваДоступа()

Функция ПолучитьМассивОбластейДоступа(ТекущийОбъект,МетаданныеОбъекта,ИмяОбъектаПолное) Экспорт
	
	МассивОбластейДоступа = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ОбластиДоступа.Ссылка КАК ОбластьДоступа
	|ИЗ
	|	Справочник.бит_ОбластиДоступа КАК бит_ОбластиДоступа
	|ГДЕ
	|	(НЕ бит_ОбластиДоступа.ПометкаУдаления)
	|	И бит_ОбластиДоступа.Владелец В
	|			(ВЫБРАТЬ
	|				бит_ОбъектыСистемы.Ссылка
	|			ИЗ
	|				Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|			ГДЕ
	|				бит_ОбъектыСистемы.ИмяОбъектаПолное = &ИмяОбъектаПолное
	|                И НЕ бит_ОбъектыСистемы.Отключено)
	|	И НЕ бит_ОбластиДоступа.Отключено";
	
	Запрос.УстановитьПараметр("ИмяОбъектаПолное",ИмяОбъектаПолное);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		ТабРеквизитов = бит_ПраваДоступа.СформироватьТаблицуРеквизитовОбъекта(ТекущийОбъект,МетаданныеОбъекта);
	КонецЕсли; 
	
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьДоступа = Выборка.ОбластьДоступа;
		СохраненнаяНастройка = ОбластьДоступа.НастройкиПостроителя.Получить();
		Если ТипЗнч(СохраненнаяНастройка) = Тип("Структура") И СохраненнаяНастройка.Свойство("Отбор") Тогда
			
			ПостроительЗапроса = Новый ПостроительЗапроса;
			ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабРеквизитов);
			
			Для каждого ЭлементОтбора Из СохраненнаяНастройка.Отбор Цикл
				Попытка
					ОписаниеЭлемента = ЭлементОтбора.ПутьКДанным;
					НовыйЭлОтбора = ПостроительЗапроса.Отбор.Добавить(ОписаниеЭлемента);
					бит_ОбщегоНазначения.ЗаполнитьЭлементОтбора(ЭлементОтбора,НовыйЭлОтбора);
				Исключение
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ТекстСообщения = НСтр("ru = '%1'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецПопытки;
			КонецЦикла; 
			ПостроительЗапроса.Выполнить();
			Если Не ПостроительЗапроса.Результат.Пустой() Тогда
				
				МассивОбластейДоступа.Добавить(Выборка.ОбластьДоступа);
				
			КонецЕсли; 
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат МассивОбластейДоступа;
КонецФункции // битПолучитьМассивОбластейДоступа()

// Процедура оповещает пользователя об отсутствии доступа. 
//
// Параметры:
//  ТекущийОбъект  – СправочникСсылка,ДокументСсылка.
//  События - Структура - ключ: строка- имя события, значение: булево - доступность события.
//  Отказ - Булево.
//
Процедура ОповеститьОбОтсутствииДоступа(ТекущийОбъект,События,Отказ)
	
	МетаданныеОбъекта = ТекущийОбъект.Метаданные();
	ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Обработка 
		ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектов.Отчет Тогда
		
		Если События.Свойство("Редактирование") Тогда
			
			События.Вставить("Доступ",События.Редактирование);
			События.Удалить("Редактирование");
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Для каждого КлючИЗначение Из События Цикл
		Если НЕ ТипЗнч(КлючИЗначение.Значение) = Тип("Булево") Тогда
			Продолжить;
		КонецЕсли; 
		Если НЕ КлючИЗначение.Значение Тогда
			ТекстСообщения = "У вас нет права на выполнение действия """+КлючИЗначение.Ключ+""" над объектом """+МетаданныеОбъекта.Синоним+""".";
			Если События.Свойство("ОбластиДоступа") Тогда
				Ном = 1;
				Для каждого Элемент Из События.ОбластиДоступа Цикл
					ТекстСообщения = ТекстСообщения+?(Ном=1," Области доступа: ",", ")+Строка(Элемент);
					Ном = Ном+1;
				КонецЦикла; 
			КонецЕсли; 
			бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ,,СтатусСообщения.Важное);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры // ОповеститьПользователяОбОтсутствииДоступа()

// Процедура обновляет справочник ОбъектыДоступа по метеданным.
//
// Параметры:
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
// 
Процедура ОбновитьОбъектыДоступа(РежимСообщений="Все") Экспорт
	
	Если НЕ ПравоДоступа("Изменение", Метаданные.Справочники.бит_ОбъектыСистемы) Тогда
		Возврат;
	КонецЕсли; 
	
	бит_ОбщегоНазначения.бит_Состояние("Обновление объектов доступа");
	
	ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Справочники"     ,РежимСообщений);
	ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Документы"       ,РежимСообщений);
	ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Отчеты"          ,РежимСообщений);
	ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("Обработки"       ,РежимСообщений);
	ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных("РегистрыСведений",РежимСообщений);	 
	
	бит_ОбщегоНазначения.бит_Состояние("");
	
КонецПроцедуры // бит_ОбновитьОбъектыДоступа()

// Процедура Заполняет/обновляет справочник объекты доступа по коллекции метаданных. 
// При изменении имени объекта выполняется поиск по типу и обновляется имя. 
//
// Параметры:
//  ИмяКоллекции  – строка.
//  РежимСообщений - Строка: "Нет","Все","Ошибки".
//
Процедура ЗаполнитьОбъектыДоступаПоКоллекцииМетаданных(ИмяКоллекции,РежимСообщений="Все")
	
	ВыводитьОшибки     = ?(РежимСообщений="Все" ИЛИ РежимСообщений="Ошибки",Истина,Ложь);
	ВыводитьИнформацию = ?(РежимСообщений="Все",Истина,Ложь);
	
	Для каждого Мета Из Метаданные[ИмяКоллекции] Цикл
		// Регистры сведений - только независимые.
		Если ИмяКоллекции = "РегистрыСведений" Тогда
			Если Мета.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
				Продолжить;
			КонецЕсли; 
		КонецЕсли; 
		
		бит_ОбщегоНазначения.бит_Состояние("Обновление объектов доступа - "+Мета.Синоним);
		
		
		ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(Мета);
		
		СтруктураПараметров = Новый Структура("ИмяОбъекта,ВидОбъекта,Наименование,ИмяОбъектаПолное,ИмяТипаОбъекта,ТипЗначенияОбъекта,Родитель");
		СтруктураПараметров.ИмяОбъекта = Мета.Имя;
		СтруктураПараметров.ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(Мета);
		СтруктураПараметров.Наименование       = Мета.Синоним;
		СтруктураПараметров.ИмяОбъектаПолное   = ПолучитьПолноеИмяОбъекта(Мета.Имя,СтруктураПараметров.ВидОбъекта);
		СтруктураПараметров.ИмяТипаОбъекта     = ПолучитьИмяТипаОбъекта(Мета.Имя,СтруктураПараметров.ВидОбъекта);
		СтруктураПараметров.ТипЗначенияОбъекта = Тип(СтруктураПараметров.ИмяТипаОбъекта);
		СтруктураПараметров.Родитель           = ОпределитьГруппуОбъектаДоступа(СтруктураПараметров.ВидОбъекта);
		
		ОбъектДоступа = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное",СтруктураПараметров.ИмяОбъектаПолное);
		Если Не ЗначениеЗаполнено(ОбъектДоступа) Тогда
			ОбъектДоступа = НайтиОбъектДоступаПоТипу(Мета.Имя,ВидОбъекта);
			// Проверим а не изменилось ли имя объекта.
			Если ЗначениеЗаполнено(ОбъектДоступа) И ОбъектДоступа.ИмяОбъекта <> Мета.Имя Тогда
				
				СпрОбъект = ОбъектДоступа.ПолучитьОбъект();;
				ЗаполнитьОбъектДоступа(СпрОбъект,СтруктураПараметров);
				Попытка
					СпрОбъект.Записать();
					Если ВыводитьИнформацию Тогда
						бит_ОбщегоНазначения.СообщитьОбОшибке("Обновлен объект доступа "+СтруктураПараметров.ИмяОбъектаПолное,,,СтатусСообщения.Информация);
					КонецЕсли; 
					Продолжить;
				Исключение
					Если ВыводитьОшибки Тогда
						бит_ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать объект доступа "+СтруктураПараметров.ИмяОбъектаПолное,,,СтатусСообщения.Информация);
					КонецЕсли; 
				КонецПопытки;
				
			КонецЕсли; 
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(ОбъектДоступа) Тогда
			СпрОбъект = Справочники.бит_ОбъектыСистемы.СоздатьЭлемент();
			ЗаполнитьОбъектДоступа(СпрОбъект,СтруктураПараметров);
			Попытка
				СпрОбъект.Записать();
				Если ВыводитьИнформацию Тогда
					бит_ОбщегоНазначения.СообщитьОбОшибке("Записан новый объект доступа "+СтруктураПараметров.ИмяОбъектаПолное,,,СтатусСообщения.Информация);
				КонецЕсли; 
			Исключение
				Если ВыводитьОшибки Тогда
					бит_ОбщегоНазначения.СообщитьОбОшибке("Не удалось записать объект доступа "+СтруктураПараметров.ИмяОбъектаПолное,,,СтатусСообщения.Информация);
				КонецЕсли; 
			КонецПопытки;
			
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры // бит_ЗаполнитьОбъектыДоступаПоКоллекции()

// Процедура заполняет свойства элемента справочника объекта доступа из структуры параметров.
//
// Параметры:
// ТекущийОбъект - СправочникСсылка.бит_ОбъектыСистемы.
//
Процедура ЗаполнитьОбъектДоступа(ТекущийОбъект,СтруктураПараметров)
	ЗаполнитьЗначенияСвойств(ТекущийОбъект,СтруктураПараметров);
	ТекущийОбъект.ТипЗначенияОбъекта = Новый ХранилищеЗначения(СтруктураПараметров.ТипЗначенияОбъекта);
КонецПроцедуры // бит_ЗаполнитьОбъектДоступа() 

// Функция определяет группу объекта доступа по виду объекта.
//
// Параметры:
//  ВидОбъекта  – ПеречислениеСсылка.бит_ВидыОбъектов;.
//
// Возвращаемое значение:
//   ТекущаяГруппа   – СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ОпределитьГруппуОбъектаДоступа(ВидОбъекта)
	
	ТекущаяГруппа = Справочники.бит_ОбъектыСистемы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.ЭтоГруппа
	|	И бит_ОбъектыСистемы.ВидОбъекта = &ВидОбъекта";
	
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ТекущаяГруппа = Выборка.Ссылка;
		
	КонецЕсли; 
	
	Возврат ТекущаяГруппа;
КонецФункции // битОпределитьГруппуОбъектаДоступа()

// Функция выполняет поиск объекта доступа по типу.
//
// Параметры:
//  ИмяОбъекта  – Строка.
//  ВидОбъекта  – ПеречислениеСсылка.бит_ОбъектыСистемы.
//
// Возвращаемое значение:
//   ТекущийОбъектДоступа   – СправочникСсылка.бит_ОбъектыСистемы.
//
Функция НайтиОбъектДоступаПоТипу(ИмяОбъекта,ВидОбъекта)
	
	ТекущийОбъектДоступа = Справочники.бит_ОбъектыСистемы.ПустаяСсылка();
	
	ИмяТипа = ПолучитьИмяТипаОбъекта(ИмяОбъекта,ВидОбъекта);
	ТипОбъектаДоступа = Тип(ИмяТипа);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка,
	|	бит_ОбъектыСистемы.ТипЗначенияОбъекта
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	НЕ бит_ОбъектыСистемы.ЭтоГруппа
	|	И бит_ОбъектыСистемы.ВидОбъекта = &ВидОбъекта";
	
	Запрос.УстановитьПараметр("ВидОбъекта",ВидОбъекта);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекущийТип = Выборка.ТипЗначенияОбъекта.Получить();
		Если ТекущийТип = ТипОбъектаДоступа Тогда
			ТекущийОбъектДоступа = Выборка.Ссылка;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат ТекущийОбъектДоступа;
КонецФункции // битНайтиОбъектДоступаПоТипу()

// Функция определяет вид объекта по метаданным объекта.
//
// Параметры:
//  МетаданныеОбъекта  – ОбъектМетаданных.
//
// Возвращаемое значение:
//   ВидОбъекта   – ПеречислениеСсылка.бит_ВидыОбъектов.
//
Функция ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта)  Экспорт
	
	ВидОбъекта = Перечисления.бит_ВидыОбъектов.ПустаяСсылка();
	
	Если Метаданные.Справочники.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник;
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда	
		ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ;
	ИначеЕсли Метаданные.Отчеты.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектов.Отчет;
	ИначеЕсли Метаданные.Обработки.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектов.Обработка;
	ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеОбъекта) Тогда
		ВидОбъекта = Перечисления.бит_ВидыОбъектов.РегистрСведений;
	КонецЕсли; 
	
	Возврат ВидОбъекта;
КонецФункции // битПолучитьВидОбъектаПоМетаданным()

// БИТ_ЖКХ 21.08.2008 Начало изменения... 
// Изменил функции на экспортные.

// Функция получает полное имя объекта.
//
// Параметры:
//  ИмяОбъекта  – Строка – Краткое имя объекта.
//  ВидОбъекта  – ПеречислениеСсылка.бит_ВидыОбъектов.
//
// Возвращаемое значение:
//   РезСтрока   – Строка.
//
Функция ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта) Экспорт
	РезСтрока = Строка(ВидОбъекта)+"."+ИмяОбъекта;
	Возврат РезСтрока;
КонецФункции // битПолучитьПолноеИмяОбъекта()

// Функция получает имя типа объекта.
//
// Параметры:
//  ИмяОбъекта  – Строка – Краткое имя объекта.
//  ВидОбъекта  – ПеречислениеСсылка.бит_ВидыОбъектов.
//
// Возвращаемое значение:
//   РезСтрока   – Строка.
//
Функция ПолучитьИмяТипаОбъекта(ИмяОбъекта,ВидОбъекта) Экспорт
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ 
		ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник Тогда
		РезСтрока = Строка(ВидОбъекта)+"Ссылка."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.Обработка 
		ИЛИ ВидОбъекта = Перечисления.бит_ВидыОбъектов.Отчет Тогда	
		РезСтрока = Строка(ВидОбъекта)+"Объект."+ИмяОбъекта;
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.РегистрСведений Тогда
		РезСтрока = "РегистрСведенийНаборЗаписей."+ИмяОбъекта;
	КонецЕсли; 
	Возврат РезСтрока;
КонецФункции // битПолучитьПолноеИмяОбъекта()

// ...бит_DKravchenko 21.08.2008 Конец изменения 

// Формирует таблицу реквизитов по переданному объекту.
// Вставлено: 15.08.2008.
//
// Параметры:
//  ТекущийОбъект      – ДокументОбъект,СправочникОбъект.
//  МетаданныеОбъекта  –. 
//
// Возвращаемое значение:
//   ТабРеквизитов   – ТаблицаЗначений.
//
Функция СформироватьТаблицуРеквизитовОбъекта(ТекущийОбъект,МетаданныеОбъекта) Экспорт
	
	ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);
	ИмяТипаОбъекта = ПолучитьИмяТипаОбъекта(МетаданныеОбъекта.Имя,ВидОбъекта);
	
	ТабРеквизитов = Новый ТаблицаЗначений;
	
	ОписаниеСтрока = Новый ОписаниеТипов("Строка");
	ОписаниеЧисло  = Новый ОписаниеТипов("Число");	
	ОписаниеТипаОбъекта = Новый ОписаниеТипов(ИмяТипаОбъекта);	
	
	// Создадим колонки.
	// Специфические свойства для справочника и документа.
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник Тогда
		Если МетаданныеОбъекта.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Строка Тогда
			ТабРеквизитов.Колонки.Добавить("Код",ОписаниеСтрока);
		ИначеЕсли МетаданныеОбъекта.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число Тогда
			ТабРеквизитов.Колонки.Добавить("Код",ОписаниеЧисло);			
		КонецЕсли; 
		ТабРеквизитов.Колонки.Добавить("Наименование",ОписаниеСтрока);
		Если МетаданныеОбъекта.Иерархический Тогда
			ТабРеквизитов.Колонки.Добавить("Родитель",ОписаниеТипаОбъекта);
		КонецЕсли; 
		Если МетаданныеОбъекта.Владельцы.Количество() > 0 Тогда
			ТабРеквизитов.Колонки.Добавить("Владелец");
		КонецЕсли;	
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ Тогда	
		Если МетаданныеОбъекта.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Строка Тогда
			ТабРеквизитов.Колонки.Добавить("Номер",ОписаниеСтрока);
		ИначеЕсли МетаданныеОбъекта.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Число Тогда	
			ТабРеквизитов.Колонки.Добавить("Номер",ОписаниеЧисло);
		КонецЕсли; 
		ТабРеквизитов.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));
	КонецЕсли; 
	ТабРеквизитов.Колонки.Добавить("Ссылка",ОписаниеТипаОбъекта);
	
	// Реквизиты объектов.
	Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		ТабРеквизитов.Колонки.Добавить(Реквизит.Имя,Новый ОписаниеТипов(Реквизит.Тип.Типы()));
	КонецЦикла;
	
	// Заполним значения.
	НоваяСтрока = ТабРеквизитов.Добавить();
	Для каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
		НоваяСтрока[Реквизит.Имя] = ТекущийОбъект[Реквизит.имя];
	КонецЦикла;
	Если ВидОбъекта = Перечисления.бит_ВидыОбъектов.Справочник Тогда
		НоваяСтрока.Код          = ТекущийОбъект.Код;
		НоваяСтрока.Наименование = ТекущийОбъект.Наименование;
		Если МетаданныеОбъекта.Иерархический Тогда
			НоваяСтрока.Родитель  = ТекущийОбъект.Родитель;
		КонецЕсли; 
		Если МетаданныеОбъекта.Владельцы.Количество() > 0 Тогда
			НоваяСтрока.Владелец  = ТекущийОбъект.Владелец;
		КонецЕсли;			
	ИначеЕсли ВидОбъекта = Перечисления.бит_ВидыОбъектов.Документ Тогда	
		НоваяСтрока.Номер = ТекущийОбъект.Номер;
		НоваяСтрока.Дата  = ТекущийОбъект.Дата;
	КонецЕсли; 
	НоваяСтрока.Ссылка = ТекущийОбъект.Ссылка;
	
	Возврат ТабРеквизитов;
	
КонецФункции // битСформироватьТаблицуРеквизитовОбъекта()

// Функция определяет доступна ли печать для данного объекта.
//
// Параметры:
//  ЭтотОбъект  – СправочникОбъект,ДокументОбъект.
// 
// Возвращаемое значение:
//   Отказ   – булево.
//
Функция ПечатьДоступна(ЭтотОбъект) Экспорт
	
	Отказ = Ложь;
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Печать",Ложь);
	События = ПроверитьПраваДоступа(ЭтотОбъект,бит_ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"),,ТекущиеСобытия);
	ОповеститьОбОтсутствииДоступа(ЭтотОбъект,События,Отказ);			
	
	Возврат НЕ Отказ; 
	
КонецФункции // бит_ПроверитьДоступностьПечати()

// Формирует массив с именами объектов,.
// На которые не распространяется механизм разделение прав доступа на уровне базы.
//
Функция СформироватьМассивИменИсключений() Экспорт
	
	МассивИсключений = Новый Массив;
	
	// Объекты, используемые в механизме разделения прав доступа.
	// Право определяется наличием роли бит_АдминистраторПравДоступа.
	МассивИсключений.Добавить("бит_ОбъектыСистемы");
	МассивИсключений.Добавить("бит_ОбластиДоступа");
	МассивИсключений.Добавить("бит_ШаблоныПравДоступа");
	МассивИсключений.Добавить("бит_ПраваДоступа");
	МассивИсключений.Добавить("бит_НастройкаПравДоступа");
	
	// Объекты используемые в механизме МХО.
	МассивИсключений.Добавить("бит_ЗначенияРеквизитовПроводок");
	МассивИсключений.Добавить("бит_НазначениеРеквизитовПроводок");
	МассивИсключений.Добавить("бит_ДанныеОтладкиПроведения");
	МассивИсключений.Добавить("бит_ИспользованиеПроводокДляДокументов");
	
	// Используется в механизме хранения истории редактирования справочников.
	МассивИсключений.Добавить("бит_ИсторияРедактированияРеквизитов");
	
	// Настройки пользователей.
	МассивИсключений.Добавить("НастройкиПользователей");
	МассивИсключений.Добавить("КонтактнаяИнформация");
	МассивИсключений.Добавить("КонтактныеЛица");
	
	Возврат МассивИсключений;
КонецФункции // битСформироватьМассивИменИсключений()

// Получает объект доступа по метаданным объекта.
//
// Параметры:
//  МетаданныеОбъекта  – ОбъектМетаданных.
//
// Возвращаемое значение:
//   РезОбъект   –  СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ПолучитьОбъектДоступаПоМетаданным(МетаданныеОбъекта) Экспорт
	
	ИмяОбъекта = МетаданныеОбъекта.Имя;
	ВидОбъекта = ПолучитьВидОбъектаПоМетаданным(МетаданныеОбъекта);	
	ИмяОбъектаПолное = ПолучитьПолноеИмяОбъекта(ИмяОбъекта,ВидОбъекта);
	
	РезОбъект = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное",ИмяОбъектаПолное);
	
	Возврат РезОбъект;
КонецФункции // ПолучитьОбъектДоступаПоМетаданным()

#Если Клиент Тогда
	
// Процедура обрабатывает событие "ПередНачаломИзменения" в списках.
// Проверяется право на редактирование.
//
// Параметры:
//  Отказ  – Булево.
//  Элемент - ЭлементУправления.
//  ТекущаяФорма - форма.
//  ДопПараметры - Структура.
//                
Процедура ПередНачаломИзмененияВСписке(Отказ,Элемент,ТекущаяФорма,ДопПараметры = Неопределено)  Экспорт
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Редактирование",Ложь);
	События = ПроверитьПраваДоступа(ТекущаяСтрока.Ссылка.ПолучитьОбъект(),бит_ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"),,ТекущиеСобытия);
	ОповеститьОбОтсутствииДоступа(ТекущаяСтрока.Ссылка,События,Отказ);			
	
КонецПроцедуры // бит_ПередНачаломИзмененияВСпискеПраваДоступа()	
	
// Процедура обрабатывает событие "ПередНачаломДобавления" в списках. 
// Проверяется право на редактирование/Создание/Копирование.
//
// Параметры:
//  Отказ  – Булево.
//  Элемент - ЭлементУправления.
//  Копирование - булево.
//  ТекущаяФорма - форма.
//  ДопПараметры - Структура.
//                
Процедура ПередНачаломДобавленияВСписке(Отказ,Элемент,Копирование,ТекущаяФорма,ДопПараметры = Неопределено)  Экспорт
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ТекущиеСобытия = Новый Структура;
	ТекущиеСобытия.Вставить("Редактирование",Ложь);
	ТекущиеСобытия.Вставить("Создание"      ,Ложь);
	Если Копирование Тогда
		ТекущиеСобытия.Вставить("Копирование",Ложь);
	КонецЕсли; 
	События = ПроверитьПраваДоступа(ТекущаяСтрока.Ссылка.ПолучитьОбъект(),бит_ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"),,ТекущиеСобытия);
	ОповеститьОбОтсутствииДоступа(ТекущаяСтрока.Ссылка,События,Отказ);			
	
КонецПроцедуры //ПередНачаломДобавленияВСписке()	
		
#КонецЕсли

#КонецОбласти

#Область ПраваДоступностиФорм

// Процедура обрабатывает событие "ПередОткрытием" в формах элемента/документа. 
// Проверяется право на создание редактирование.
//
// Параметры:
//  Отказ  – Булево.
//  Элемент - ЭлементУправления.
//  ТекущаяФорма - форма.
//  ДопПараметры - Структура.
//                
Процедура ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,ТекущийОбъект,ТекущаяФорма,ДопПараметры=Неопределено) Экспорт
	
	// Если копирование запрещено - форму не открываем.	
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("Отказ") Тогда
		
		Если ТекущийОбъект.ДополнительныеСвойства.Отказ Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;
	
	События = ПроверитьПраваДоступа(ТекущийОбъект, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	// Если создание запрещено - форму не открываем.
	Если События.Свойство("Создание") Тогда
		ОповеститьОбОтсутствииДоступа(ТекущийОбъект,События,Отказ);			
	КонецЕсли; 
	
	// Если редактирование запрещено устанавливаем на форму ТолькоПросмотр.
	Если События.Свойство("Редактирование") Тогда
		
		ТекущаяФорма.ТолькоПросмотр = НЕ События.Редактирование;
		
	КонецЕсли; 
	
КонецПроцедуры // бит_ПередОткрытиемФормыПраваДоступа()	

// БИТ_ЖКХ 23.07.2014{{
// Процедура обрабатывает событие "ПередОткрытием" в формах отчета/обработки.
// Проверяется право на доступ к объекту.
//
// Параметры:
//  Отказ  – Булево.
//  Элемент - ЭлементУправления.
//  ТекущаяФорма - форма.
//  ДопПараметры - Структура.
//                
Процедура ПередОткрытиемФормыОтчета(Отказ,СтандартнаяОбработка,ТекущийОбъект,ТекущаяФорма,ДопПараметры=Неопределено) Экспорт
	
	События = ПроверитьПраваДоступа(ТекущийОбъект,бит_ОбщегоНазначения.ПолучитьЗначениеПеременной("глТекущийПользователь"));
	ОповеститьОбОтсутствииДоступа(ТекущийОбъект,События,Отказ);			
	
КонецПроцедуры
// БИТ_ЖКХ 23.07.2014}}

#КонецОбласти
